Revit 2026 API

# StairsPathDownTextOffset Property

---

The offset of stairs down text.

**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public XYZ DownTextOffset { get; set; }
```
```vb
Public Property DownTextOffset As XYZ
	Get
	Set
```
```cpp
public:
property XYZ^ DownTextOffset {
	XYZ^ get ();
	void set (XYZ^ value);
}
```
```fsharp
member DownTextOffset : XYZ with get, set
```

#### Property Value

XYZ

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |
| InvalidOperationException | When setting this property: The type of this stairs path is not automatic up/down direction. -or- When setting this property: The stairs path doesn't show down text so the data being set is inapplicable. |

The z direction makes no sense in API.

#### Reference

StairsPath Class

Autodesk.Revit.DB.Architecture Namespace